МПР/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДополнительныеОтчетыИОбработки</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>БезопасныйРежим</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Версия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Вид</name>
    <type>
      <types>EnumRef.ВидыДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>256</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>260</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Информация</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыОбъекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДляФормыСписка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикация</name>
    <type>
      <types>EnumRef.ВариантыПубликацииДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеОбработки</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетХранилищеВариантов</name>
    <comment>Когда Истина то дополнительный отчет подключен к хранилищу вариантов &quot;ХранилищеВариантовОтчетов&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТеснаяИнтеграцияСФормойОтчета</name>
    <comment>Когда Истина то у отчета есть программный интерфейс для тесной интеграции с общей формой &quot;ФормаОтчета&quot;.</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимСовместимостиРазрешений</name>
    <type>
      <types>EnumRef.РежимыСовместимостиРазрешенийДополнительныхОтчетовИОбработок</types>
    </type>
  </attributes>
  <attributes>
    <name>ds_НеВыгружатьВМагазины</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Команды</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантЗапуска</name>
      <type>
        <types>EnumRef.СпособыВызоваДополнительныхОбработок</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПоказыватьОповещение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Модификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>РегламентноеЗаданиеGUID</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Скрыть</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаменяемыеКоманды</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Назначение</name>
    <attributes>
      <name>ОбъектНазначения</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разделы</name>
    <attributes>
      <name>Раздел</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Разрешения</name>
    <attributes>
      <name>ВидРазрешения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

МПР/src/IntegrationServices/ds_СервисОфиса/Module.bsl
Процедура СетьМагазинов_ВОфисОбработкаПолученияСообщения(Сообщение, Отказ)
	
	СсылкаНаОбъект = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("ExchangeMPR", Истина);
	ИмяОбработки = ВнешниеОбработки.Подключить(ПолучитьНавигационнуюСсылку(СсылкаНаОбъект, "ХранилищеОбработки"),, Ложь, ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	Обработка = ВнешниеОбработки.Создать(ИмяОбработки);
			
	РазмерСообщения = Сообщение.Параметры.Получить("РазмерСообщения"); 
	Если РазмерСообщения <> Неопределено Тогда 
		РазмерБуфера = Число(РазмерСообщения); 
	Иначе    
		РазмерБуфера = 1024; 
	КонецЕсли; 
	
	Тело = Новый БуферДвоичныхДанных(0);
	Буфер = Новый БуферДвоичныхДанных(РазмерБуфера); 
	
	Поток = Сообщение.ПолучитьТелоКакПоток(); 
	
	Пока Истина Цикл   
		Попытка
			Прочитано = Поток.Прочитать(Буфер, 0, РазмерБуфера);
		Исключение
			Возврат;
		КонецПопытки;
		
		Если Прочитано > 0 Тогда
			Тело = Тело.Соединить(Буфер); 
		КонецЕсли;
		Если Прочитано < РазмерБуфера Тогда  
			Прервать;  
		КонецЕсли; 
	КонецЦикла; 
	
	СтрокаСообщения = ПолучитьСтрокуИзБуфераДвоичныхДанных(Тело); 
	
	ЧтениеJson = Новый ЧтениеJSON;
	ЧтениеJson.УстановитьСтроку(СтрокаСообщения);
	Данные = ПрочитатьJSON(ЧтениеJson);
	
	Отправитель = ПланыОбмена.ds_ОбменСОфисом.НайтиПоКоду(Данные.Отправитель);
	Если Отправитель.Пустая() Тогда
		Возврат;
	КонецЕсли;	
				
	ТипСообщения = Сообщение.Параметры.Получить("ТипСообщения");  
	Если ТипСообщения = "Обмен" Тогда
		Если Не Отправитель.ПропускатьСообщения Тогда 
			Обработка.ЗагрузитьИзмененияОтМагазина(Данные);
		КонецЕсли;	
		
		Узел = Отправитель.ПолучитьОбъект();
		Узел.Версия = Данные.Версия;
		Узел.НомерПринятого = Число(Данные.НомерОтправленного);
		Узел.ДатаОбмена = ТекущаяДата();
		Узел.Записать();
	ИначеЕсли ТипСообщения = "СверкаОстатков" Тогда		
		Если Не Отправитель.ПропускатьСообщения Тогда
			НомерСообщения = Сообщение.Параметры.Получить("НомерСообщения");
			Если НомерСообщения = "2" Тогда 
				Обработка.ПрочитатьСообщение2ВОфисе(Данные);
			ИначеЕсли НомерСообщения = "4" Тогда 
				Обработка.ПрочитатьСообщение4ВОфисе(Данные);
				
				Узел = Отправитель.ПолучитьОбъект();
				Узел.ДатаАктивнойСверки = Дата(1, 1, 1);
				Узел.Записать();								
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
	
КонецПроцедуры
